app/Http/Controllers/ApotreController.php

    public function store(Request $request)
    {
        $request->validate([
        'apotre_name'=>'required',
        'apotre_surname'=>'required',
        'apotre_paroisse'=>'required',
        'apotre_zone'=>'required',
        'apotre_status'=>'required'
      ]);
      $apotre = new Apotre([
        'apotre_name' => $request->get('apotre_name'),
        'apotre_surname' => $request->get('apotre_surname'),
        'apotre_dateNais' => $request->get('apotre_dateNais'),
        'apotre_paroisse' => $request->get('apotre_paroisse'),
        'apotre_zone' => $request->get('apotre_zone'),
        'apotre_status' => $request->get('apotre_status')
      ]);
     $apotre->save();
---
insert into `apotres` (`apotre_name`, `apotre_surname`, `apotre_dateNais`, `apotre_paroisse`, `apotre_zone`, `apotre_status`, `updated_at`, `created_at`) values ('Tachi Tchoffo', 'Félix', '1984-03-11', 'saint charles Lwanga', 'Wourri 3', 'Volontaire', '2019-07-30 00:18:25', '2019-07-30 00:18:25')