app/Http/Controllers/ApotreController.php

select * from `apotres`
---
    public function index()
    {
        if (request()->ajax()) {
            return datatables()->of(Apotre::latest()->get())
                ->addColumn('action', function ($data) {
                    $button = '<button type="button" name="edit" id="' . $data->id . '" class="edit btn btn-primary btn-sm">Editer</button>';
                    $button .= '&nbsp;&nbsp;';
                    $button .= '<button type="button" name="delete" id="' . $data->id . '" class="delete btn btn-danger btn-sm">Supprimer</button>';
                    return $button;
                })
                ->rawColumns(['action'])
                ->make(true);